zmzdh/CAN_st_test/Drivers/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_rmu.h
 /**    
  *******************************************************************************************************
  * @file    fm33fg0xxa_fl_rmu.h
  * @author  FMSH Application Team
  * @brief   Head file of RMU FL Module
  *******************************************************************************************************
  * @attention    
  * Copyright (c) 2023, SHANGHAI FUDAN MICROELECTRONICS GROUP CO., LTD.(FUDAN MICROELECTRONICS./ FUDAN MICRO.)    
  * All rights reserved.    
  *    
  * Processor:                   FM33FG0xxA    
  * http:                        http://www.fmdevelopers.com.cn/    
  *    
  * Redistribution and use in source and binary forms, with or without    
  * modification, are permitted provided that the following conditions are met    
  *    
  * 1. Redistributions of source code must retain the above copyright notice,    
  *    this list of conditions and the following disclaimer.    
  *    
  * 2. Redistributions in binary form must reproduce the above copyright notice,    
  *    this list of conditions and the following disclaimer in the documentation    
  *    and/or other materials provided with the distribution.    
  *    
  * 3. Neither the name of the copyright holder nor the names of its contributors    
  *    may be used to endorse or promote products derived from this software    
  *    without specific prior written permission.    
  *    
  * 4. To provide the most up-to-date information, the revision of our documents     
  *    on the World Wide Web will be the most Current. Your printed copy may be      
  *    an earlier revision. To verify you have the latest information avaliable,    
  *    refer to: http://www.fmdevelopers.com.cn/.    
  *    
  * THIS SOFTWARE IS PROVIDED BY FUDAN MICRO "AS IS" AND ANY EXPRESSED:     
  * ORIMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES     
  * OF MERCHANTABILITY NON-INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE    
  * ARE DISCLAIMED.IN NO EVENT SHALL FUDAN MICRO OR ITS CONTRIBUTORS BE LIABLE     
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL     
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS     
  * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER    
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,     
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISINGIN ANY WAY OUT OF THE     
  * USE OF THIS SOFTWARE, EVEN IF ADVISED OFTHE POSSIBILITY OF SUCH DAMAGE.    
  *
  *******************************************************************************************************
  */    

/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33FG0XXA_FL_RMU_H
#define __FM33FG0XXA_FL_RMU_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33fg0xxa_fl_def.h"
/** @addtogroup FM33FG0XXA_FL_Driver
  * @{
  */
/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup RMU_FL_ES_INIT RMU Exported Init structures
  * @{
  */

/**
  * @brief FL RMU Init Sturcture definition
  */

/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup RMU_FL_Exported_Constants RMU Exported Constants
  * @{
  */

#define    RMU_PDRCR_CFG_Pos                                      (1U)
#define    RMU_PDRCR_CFG_Msk                                      (0x3U << RMU_PDRCR_CFG_Pos)
#define    RMU_PDRCR_CFG                                          RMU_PDRCR_CFG_Msk

#define    RMU_PDRCR_EN_Pos                                       (0U)
#define    RMU_PDRCR_EN_Msk                                       (0x1U << RMU_PDRCR_EN_Pos)
#define    RMU_PDRCR_EN                                           RMU_PDRCR_EN_Msk

#define    RMU_BORCR_CFG_Pos                                      (2U)
#define    RMU_BORCR_CFG_Msk                                      (0x7U << RMU_BORCR_CFG_Pos)
#define    RMU_BORCR_CFG                                          RMU_BORCR_CFG_Msk

#define    RMU_BORCR_ENB_Pos                                      (0U)
#define    RMU_BORCR_ENB_Msk                                      (0x1U << RMU_BORCR_ENB_Pos)
#define    RMU_BORCR_ENB                                          RMU_BORCR_ENB_Msk

#define    RMU_LKPCR_LOLRST_EN_Pos                                (7U)
#define    RMU_LKPCR_LOLRST_EN_Msk                                (0x1U << RMU_LKPCR_LOLRST_EN_Pos)
#define    RMU_LKPCR_LOLRST_EN                                    RMU_LKPCR_LOLRST_EN_Msk

#define    RMU_LKPCR_LOCRST_EN_Pos                                (6U)
#define    RMU_LKPCR_LOCRST_EN_Msk                                (0x1U << RMU_LKPCR_LOCRST_EN_Pos)
#define    RMU_LKPCR_LOCRST_EN                                    RMU_LKPCR_LOCRST_EN_Msk

#define    RMU_LKPCR_LKUPRST_EN_Pos                               (1U)
#define    RMU_LKPCR_LKUPRST_EN_Msk                               (0x1U << RMU_LKPCR_LKUPRST_EN_Pos)
#define    RMU_LKPCR_LKUPRST_EN                                   RMU_LKPCR_LKUPRST_EN_Msk

#define    RMU_RSTFR_CLM1_TOUT_FLAG_Pos                           (21U)
#define    RMU_RSTFR_CLM1_TOUT_FLAG_Msk                           (0x1U << RMU_RSTFR_CLM1_TOUT_FLAG_Pos)
#define    RMU_RSTFR_CLM1_TOUT_FLAG                               RMU_RSTFR_CLM1_TOUT_FLAG_Msk

#define    RMU_RSTFR_CLM1_UDF_FLAG_Pos                            (20U)
#define    RMU_RSTFR_CLM1_UDF_FLAG_Msk                            (0x1U << RMU_RSTFR_CLM1_UDF_FLAG_Pos)
#define    RMU_RSTFR_CLM1_UDF_FLAG                                RMU_RSTFR_CLM1_UDF_FLAG_Msk

#define    RMU_RSTFR_CLM1_OVF_FLAG_Pos                            (19U)
#define    RMU_RSTFR_CLM1_OVF_FLAG_Msk                            (0x1U << RMU_RSTFR_CLM1_OVF_FLAG_Pos)
#define    RMU_RSTFR_CLM1_OVF_FLAG                                RMU_RSTFR_CLM1_OVF_FLAG_Msk

#define    RMU_RSTFR_CLM0_TOUT_FLAG_Pos                           (18U)
#define    RMU_RSTFR_CLM0_TOUT_FLAG_Msk                           (0x1U << RMU_RSTFR_CLM0_TOUT_FLAG_Pos)
#define    RMU_RSTFR_CLM0_TOUT_FLAG                               RMU_RSTFR_CLM0_TOUT_FLAG_Msk

#define    RMU_RSTFR_CLM0_UDF_FLAG_Pos                            (17U)
#define    RMU_RSTFR_CLM0_UDF_FLAG_Msk                            (0x1U << RMU_RSTFR_CLM0_UDF_FLAG_Pos)
#define    RMU_RSTFR_CLM0_UDF_FLAG                                RMU_RSTFR_CLM0_UDF_FLAG_Msk

#define    RMU_RSTFR_CLM0_OVF_FLAG_Pos                            (16U)
#define    RMU_RSTFR_CLM0_OVF_FLAG_Msk                            (0x1U << RMU_RSTFR_CLM0_OVF_FLAG_Pos)
#define    RMU_RSTFR_CLM0_OVF_FLAG                                RMU_RSTFR_CLM0_OVF_FLAG_Msk

#define    RMU_RSTFR_MAP_FLAG_Pos                                 (13U)
#define    RMU_RSTFR_MAP_FLAG_Msk                                 (0x1U << RMU_RSTFR_MAP_FLAG_Pos)
#define    RMU_RSTFR_MAP_FLAG                                     RMU_RSTFR_MAP_FLAG_Msk

