zmzdh/CAN_st_test/Drivers/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_rmu.h
#define    RMU_RSTFR_MDFN_FLAG_Pos                                (12U)
#define    RMU_RSTFR_MDFN_FLAG_Msk                                (0x1U << RMU_RSTFR_MDFN_FLAG_Pos)
#define    RMU_RSTFR_MDFN_FLAG                                    RMU_RSTFR_MDFN_FLAG_Msk

#define    RMU_RSTFR_NRSTN_FLAG_Pos                               (11U)
#define    RMU_RSTFR_NRSTN_FLAG_Msk                               (0x1U << RMU_RSTFR_NRSTN_FLAG_Pos)
#define    RMU_RSTFR_NRSTN_FLAG                                   RMU_RSTFR_NRSTN_FLAG_Msk

#define    RMU_RSTFR_PRC_FLAG_Pos                                 (10U)
#define    RMU_RSTFR_PRC_FLAG_Msk                                 (0x1U << RMU_RSTFR_PRC_FLAG_Pos)
#define    RMU_RSTFR_PRC_FLAG                                     RMU_RSTFR_PRC_FLAG_Msk

#define    RMU_RSTFR_PORN_FLAG_Pos                                (9U)
#define    RMU_RSTFR_PORN_FLAG_Msk                                (0x1U << RMU_RSTFR_PORN_FLAG_Pos)
#define    RMU_RSTFR_PORN_FLAG                                    RMU_RSTFR_PORN_FLAG_Msk

#define    RMU_RSTFR_PDRN_FLAG_Pos                                (8U)
#define    RMU_RSTFR_PDRN_FLAG_Msk                                (0x1U << RMU_RSTFR_PDRN_FLAG_Pos)
#define    RMU_RSTFR_PDRN_FLAG                                    RMU_RSTFR_PDRN_FLAG_Msk

#define    RMU_RSTFR_LOL_FLAG_Pos                                 (7U)
#define    RMU_RSTFR_LOL_FLAG_Msk                                 (0x1U << RMU_RSTFR_LOL_FLAG_Pos)
#define    RMU_RSTFR_LOL_FLAG                                     RMU_RSTFR_LOL_FLAG_Msk

#define    RMU_RSTFR_LOC_FLAG_Pos                                 (6U)
#define    RMU_RSTFR_LOC_FLAG_Msk                                 (0x1U << RMU_RSTFR_LOC_FLAG_Pos)
#define    RMU_RSTFR_LOC_FLAG                                     RMU_RSTFR_LOC_FLAG_Msk

#define    RMU_RSTFR_SOFTN_FLAG_Pos                               (5U)
#define    RMU_RSTFR_SOFTN_FLAG_Msk                               (0x1U << RMU_RSTFR_SOFTN_FLAG_Pos)
#define    RMU_RSTFR_SOFTN_FLAG                                   RMU_RSTFR_SOFTN_FLAG_Msk

#define    RMU_RSTFR_IWDTN_FLAG_Pos                               (4U)
#define    RMU_RSTFR_IWDTN_FLAG_Msk                               (0x1U << RMU_RSTFR_IWDTN_FLAG_Pos)
#define    RMU_RSTFR_IWDTN_FLAG                                   RMU_RSTFR_IWDTN_FLAG_Msk

#define    RMU_RSTFR_WWDTN_FLAG_Pos                               (2U)
#define    RMU_RSTFR_WWDTN_FLAG_Msk                               (0x1U << RMU_RSTFR_WWDTN_FLAG_Pos)
#define    RMU_RSTFR_WWDTN_FLAG                                   RMU_RSTFR_WWDTN_FLAG_Msk

#define    RMU_RSTFR_LKUPN_FLAG_Pos                               (1U)
#define    RMU_RSTFR_LKUPN_FLAG_Msk                               (0x1U << RMU_RSTFR_LKUPN_FLAG_Pos)
#define    RMU_RSTFR_LKUPN_FLAG                                   RMU_RSTFR_LKUPN_FLAG_Msk

#define    RMU_RSTFR_NVICN_FLAG_Pos                               (0U)
#define    RMU_RSTFR_NVICN_FLAG_Msk                               (0x1U << RMU_RSTFR_NVICN_FLAG_Pos)
#define    RMU_RSTFR_NVICN_FLAG                                   RMU_RSTFR_NVICN_FLAG_Msk

#define    PERHRSTEN_KEY                                          (0x13579BDFUL)
#define    SOFTWARERESET_KEY                                      (0x5C5CAABBUL)

#define    FL_RMU_RSTAHB_DMA                                      (0x1U << 0U)
#define    FL_RMU_RSTAPB_UART5                                    (0x1fU << 0U)
#define    FL_RMU_RSTAPB_UART4                                    (0x1eU << 0U)
#define    FL_RMU_RSTAPB_UART3                                    (0x1dU << 0U)
#define    FL_RMU_RSTAPB_UART2                                    (0x1cU << 0U)
#define    FL_RMU_RSTAPB_UART1                                    (0x1bU << 0U)
#define    FL_RMU_RSTAPB_UART0                                    (0x1aU << 0U)
#define    FL_RMU_RSTAPB_UCIR                                     (0x19U << 0U)
#define    FL_RMU_RSTAPB_LPUART2                                  (0x18U << 0U)
#define    FL_RMU_RSTAPB_SPI3                                     (0x17U << 0U)
#define    FL_RMU_RSTAPB_SPI2                                     (0x16U << 0U)
#define    FL_RMU_RSTAPB_SPI1                                     (0x15U << 0U)
#define    FL_RMU_RSTAPB_SPI0                                     (0x14U << 0U)
#define    FL_RMU_RSTAPB_GPTIM2                                   (0x13U << 0U)
#define    FL_RMU_RSTAPB_GPTIM1                                   (0x12U << 0U)
#define    FL_RMU_RSTAPB_GPTIM0                                   (0x11U << 0U)
#define    FL_RMU_RSTAPB_FSCAN                                    (0x10U << 0U)
#define    FL_RMU_RSTAPB_LPUART1                                  (0xfU << 0U)
#define    FL_RMU_RSTAPB_LPUART0                                  (0xeU << 0U)
#define    FL_RMU_RSTAPB_I2CSMB1                                  (0xdU << 0U)
#define    FL_RMU_RSTAPB_I2CSMB0                                  (0xcU << 0U)
#define    FL_RMU_RSTAPB_I2C1                                     (0x9U << 0U)
#define    FL_RMU_RSTAPB_I2C0                                     (0x8U << 0U)
#define    FL_RMU_RSTAPB_LPTIM32                                  (0x7U << 0U)
#define    FL_RMU_RSTAPB_BSTIM32                                  (0x6U << 0U)
#define    FL_RMU_RSTAPB_PGL                                      (0x5U << 0U)
#define    FL_RMU_RSTAPB_ATIM                                     (0x4U << 0U)
#define    FL_RMU_RSTAPB_TAU1                                     (0x3U << 0U)
#define    FL_RMU_RSTAPB_TAU0                                     (0x2U << 0U)
#define    FL_RMU_RSTAPB_LPTIM16                                  (0x1U << 0U)
#define    FL_RMU_RSTAPB_BSTIM16                                  (0x0U << 0U)
#define    FL_RMU_RSTAPB_CANFD1R                                  (0x3fU << 0U)
#define    FL_RMU_RSTAPB_CANFD1P                                  (0x3eU << 0U)
#define    FL_RMU_RSTAPB_CANFD1C                                  (0x3dU << 0U)
#define    FL_RMU_RSTAPB_CANFD0R                                  (0x3cU << 0U)
#define    FL_RMU_RSTAPB_CANFD0P                                  (0x3bU << 0U)
#define    FL_RMU_RSTAPB_CANFD0C                                  (0x3aU << 0U)
#define    FL_RMU_RSTAPB_DAC                                      (0x39U << 0U)
#define    FL_RMU_RSTAPB_ADCCR                                    (0x38U << 0U)
#define    FL_RMU_RSTAPB_ADC                                      (0x37U << 0U)
#define    FL_RMU_RSTAPB_CLM1                                     (0x36U << 0U)
#define    FL_RMU_RSTAPB_CLM0                                     (0x35U << 0U)
#define    FL_RMU_RSTAPB_SENT1                                    (0x34U << 0U)
#define    FL_RMU_RSTAPB_SENT0                                    (0x33U << 0U)
#define    FL_RMU_RSTAPB_AES                                      (0x32U << 0U)
#define    FL_RMU_RSTAPB_CRC                                      (0x31U << 0U)
#define    FL_RMU_RSTAPB_RNG                                      (0x30U << 0U)
#define    FL_RMU_RSTAPB_HDIV                                     (0x23U << 0U)
#define    FL_RMU_RSTAPB_SVD                                      (0x21U << 0U)
#define    FL_RMU_RSTAPB_COMP                                     (0x20U << 0U)



#define    FL_RMU_PDR_THRESHOLD_1P40V                             (0x0U << RMU_PDRCR_CFG_Pos)
#define    FL_RMU_PDR_THRESHOLD_1P45V                             (0x1U << RMU_PDRCR_CFG_Pos)
#define    FL_RMU_PDR_THRESHOLD_1P50V                             (0x2U << RMU_PDRCR_CFG_Pos)
#define    FL_RMU_PDR_THRESHOLD_1P55V                             (0x3U << RMU_PDRCR_CFG_Pos)


