zmzdh/CAN_st_test/Drivers/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_rmu.h
#define    FL_RMU_BOR_THRESHOLD_1P80V                             (0x0U << RMU_BORCR_CFG_Pos)
#define    FL_RMU_BOR_THRESHOLD_2P00V                             (0x1U << RMU_BORCR_CFG_Pos)
#define    FL_RMU_BOR_THRESHOLD_2P20V                             (0x2U << RMU_BORCR_CFG_Pos)
#define    FL_RMU_BOR_THRESHOLD_2P40V                             (0x3U << RMU_BORCR_CFG_Pos)
#define    FL_RMU_BOR_THRESHOLD_2P70V                             (0x4U << RMU_BORCR_CFG_Pos)
#define    FL_RMU_BOR_THRESHOLD_3P00V                             (0x5U << RMU_BORCR_CFG_Pos)
#define    FL_RMU_BOR_THRESHOLD_3P60V                             (0x6U << RMU_BORCR_CFG_Pos)
#define    FL_RMU_BOR_THRESHOLD_4P00V                             (0x7U << RMU_BORCR_CFG_Pos)


/**
  * @}
  */
/* Exported functions ---------------------------------------------------------------------------------*/
/** @defgroup RMU_FL_Exported_Functions RMU Exported Functions
  * @{
  */

/**
  * @brief    Set Power Down Reset Voltage
  * @rmtoll   PDRCR    CFG    FL_RMU_PDR_SetThreshold
  * @param    RMUx RMU instance
  * @param    threshold This parameter can be one of the following values:
  *           @arg @ref FL_RMU_PDR_THRESHOLD_1P40V
  *           @arg @ref FL_RMU_PDR_THRESHOLD_1P45V
  *           @arg @ref FL_RMU_PDR_THRESHOLD_1P50V
  *           @arg @ref FL_RMU_PDR_THRESHOLD_1P55V
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_PDR_SetThreshold(RMU_Type* RMUx, uint32_t threshold)
{
    MODIFY_REG(RMUx->PDRCR, RMU_PDRCR_CFG_Msk, threshold);
}

/**
  * @brief    Get Power Down Reset Voltage Setting
  * @rmtoll   PDRCR    CFG    FL_RMU_PDR_GetThreshold
  * @param    RMUx RMU instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_RMU_PDR_THRESHOLD_1P40V
  *           @arg @ref FL_RMU_PDR_THRESHOLD_1P45V
  *           @arg @ref FL_RMU_PDR_THRESHOLD_1P50V
  *           @arg @ref FL_RMU_PDR_THRESHOLD_1P55V
  */
__STATIC_INLINE uint32_t FL_RMU_PDR_GetThreshold(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->PDRCR, RMU_PDRCR_CFG_Msk));
}

/**
  * @brief    Get Power Down Reset Enable Status
  * @rmtoll   PDRCR    EN    FL_RMU_PDR_IsEnabled
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_PDR_IsEnabled(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->PDRCR, RMU_PDRCR_EN_Msk) == RMU_PDRCR_EN_Msk);
}

/**
  * @brief    Disable Power Down Reset
  * @rmtoll   PDRCR    EN    FL_RMU_PDR_Disable
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_PDR_Disable(RMU_Type* RMUx)
{
    CLEAR_BIT(RMUx->PDRCR, RMU_PDRCR_EN_Msk);
}

/**
  * @brief    Enable Power Down Reset
  * @rmtoll   PDRCR    EN    FL_RMU_PDR_Enable
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_PDR_Enable(RMU_Type* RMUx)
{
    SET_BIT(RMUx->PDRCR, RMU_PDRCR_EN_Msk);
}

/**
  * @brief    Set Brown Out Reset Voltage
  * @rmtoll   BORCR    CFG    FL_RMU_BOR_SetThreshold
  * @param    RMUx RMU instance
  * @param    threshold This parameter can be one of the following values:
  *           @arg @ref FL_RMU_BOR_THRESHOLD_1P80V
  *           @arg @ref FL_RMU_BOR_THRESHOLD_2P00V
  *           @arg @ref FL_RMU_BOR_THRESHOLD_2P20V
  *           @arg @ref FL_RMU_BOR_THRESHOLD_2P40V
  *           @arg @ref FL_RMU_BOR_THRESHOLD_2P70V
  *           @arg @ref FL_RMU_BOR_THRESHOLD_3P00V
  *           @arg @ref FL_RMU_BOR_THRESHOLD_3P60V
  *           @arg @ref FL_RMU_BOR_THRESHOLD_4P00V
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_BOR_SetThreshold(RMU_Type* RMUx, uint32_t threshold)
{
    MODIFY_REG(RMUx->BORCR, RMU_BORCR_CFG_Msk, threshold);
}

/**
  * @brief    Get Brown Out Reset Setting
  * @rmtoll   BORCR    CFG    FL_RMU_BOR_GetThreshold
  * @param    RMUx RMU instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_RMU_BOR_THRESHOLD_1P80V
  *           @arg @ref FL_RMU_BOR_THRESHOLD_2P00V
  *           @arg @ref FL_RMU_BOR_THRESHOLD_2P20V
  *           @arg @ref FL_RMU_BOR_THRESHOLD_2P40V
  *           @arg @ref FL_RMU_BOR_THRESHOLD_2P70V
  *           @arg @ref FL_RMU_BOR_THRESHOLD_3P00V
  *           @arg @ref FL_RMU_BOR_THRESHOLD_3P60V
  *           @arg @ref FL_RMU_BOR_THRESHOLD_4P00V
  */
__STATIC_INLINE uint32_t FL_RMU_BOR_GetThreshold(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->BORCR, RMU_BORCR_CFG_Msk));
}

/**
  * @brief    Get Brown Out Reset Enable Status
  * @rmtoll   BORCR    ENB    FL_RMU_BOR_IsEnabled
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_BOR_IsEnabled(RMU_Type* RMUx)
{
    return (uint32_t)!(READ_BIT(RMUx->BORCR, RMU_BORCR_ENB_Msk) == RMU_BORCR_ENB_Msk);
}

/**
  * @brief    Disable Brown Out Reset
  * @rmtoll   BORCR    ENB    FL_RMU_BOR_Disable
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_BOR_Disable(RMU_Type* RMUx)
{
    SET_BIT(RMUx->BORCR, RMU_BORCR_ENB_Msk);
}

/**
  * @brief    Enable Brown Out Reset
  * @rmtoll   BORCR    ENB    FL_RMU_BOR_Enable
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_BOR_Enable(RMU_Type* RMUx)
{
    CLEAR_BIT(RMUx->BORCR, RMU_BORCR_ENB_Msk);
}

/**
  * @brief    Get PLL Lost Lock Reset Enable Status
  * @rmtoll   LKPCR    LOLRST_EN    FL_RMU_IsEnabledPLLLostLockReset
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_IsEnabledPLLLostLockReset(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->LKPCR, RMU_LKPCR_LOLRST_EN_Msk) == RMU_LKPCR_LOLRST_EN_Msk);
}

/**
  * @brief    Disable  PLL Lost Lock  Reset 
  * @rmtoll   LKPCR    LOLRST_EN    FL_RMU_DisablePLLLostLockReset
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_DisablePLLLostLockReset(RMU_Type* RMUx)
{
    CLEAR_BIT(RMUx->LKPCR, RMU_LKPCR_LOLRST_EN_Msk);
}

/**
  * @brief    Enable PLL Lost Lock  Reset
  * @rmtoll   LKPCR    LOLRST_EN    FL_RMU_EnablePLLLostLockReset
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_EnablePLLLostLockReset(RMU_Type* RMUx)
{
    SET_BIT(RMUx->LKPCR, RMU_LKPCR_LOLRST_EN_Msk);
}

/**
  * @brief    Get Crystal Stop Reset Enable Status
  * @rmtoll   LKPCR    LOCRST_EN    FL_RMU_IsEnabledCrystalStopReset
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_IsEnabledCrystalStopReset(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->LKPCR, RMU_LKPCR_LOCRST_EN_Msk) == RMU_LKPCR_LOCRST_EN_Msk);
}

/**
  * @brief    Disable Crystal Stop Reset 
  * @rmtoll   LKPCR    LOCRST_EN    FL_RMU_DisableCrystalStopReset
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_DisableCrystalStopReset(RMU_Type* RMUx)
{
    CLEAR_BIT(RMUx->LKPCR, RMU_LKPCR_LOCRST_EN_Msk);
}

/**
  * @brief    Enable Crystal Stop Reset
  * @rmtoll   LKPCR    LOCRST_EN    FL_RMU_EnableCrystalStopReset
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_EnableCrystalStopReset(RMU_Type* RMUx)
{
    SET_BIT(RMUx->LKPCR, RMU_LKPCR_LOCRST_EN_Msk);
}

/**
  * @brief    Get LockUp Reset Enable Status
  * @rmtoll   LKPCR    LKUPRST_EN    FL_RMU_IsEnabledLockUpReset
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_IsEnabledLockUpReset(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->LKPCR, RMU_LKPCR_LKUPRST_EN_Msk) == RMU_LKPCR_LKUPRST_EN_Msk);
}

/**
  * @brief    Disable LockUp Reset 
  * @rmtoll   LKPCR    LKUPRST_EN    FL_RMU_DisableLockUpReset
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_DisableLockUpReset(RMU_Type* RMUx)
{
    CLEAR_BIT(RMUx->LKPCR, RMU_LKPCR_LKUPRST_EN_Msk);
}

/**
  * @brief    Enable LockUp Reset
  * @rmtoll   LKPCR    LKUPRST_EN    FL_RMU_EnableLockUpReset
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_EnableLockUpReset(RMU_Type* RMUx)
{
    SET_BIT(RMUx->LKPCR, RMU_LKPCR_LKUPRST_EN_Msk);
}

/**
  * @brief    Soft Reset Chip
  * @rmtoll   SOFTRST        FL_RMU_SetSoftReset
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_SetSoftReset(RMU_Type* RMUx)
{
    WRITE_REG(RMUx->SOFTRST, SOFTWARERESET_KEY);
}

/**
  * @brief    Get CLM1 Time Out Reset Flag
  * @rmtoll   RSTFR    CLM1_TOUT_FLAG    FL_RMU_IsActiveFlag_CLM1_TOUT
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_IsActiveFlag_CLM1_TOUT(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->RSTFR, RMU_RSTFR_CLM1_TOUT_FLAG_Msk) == (RMU_RSTFR_CLM1_TOUT_FLAG_Msk));
}

/**
  * @brief    Clear CLM1 Time Out Reset Flag
  * @rmtoll   RSTFR    CLM1_TOUT_FLAG    FL_RMU_ClearFlag_CLM1_TOUT
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_ClearFlag_CLM1_TOUT(RMU_Type* RMUx)
{
    WRITE_REG(RMUx->RSTFR, RMU_RSTFR_CLM1_TOUT_FLAG_Msk);
}

/**
  * @brief    Get CLM1 Underflow Reset Flag
  * @rmtoll   RSTFR    CLM1_UDF_FLAG    FL_RMU_IsActiveFlag_CLM1_UDF
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_IsActiveFlag_CLM1_UDF(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->RSTFR, RMU_RSTFR_CLM1_UDF_FLAG_Msk) == (RMU_RSTFR_CLM1_UDF_FLAG_Msk));
}

/**
  * @brief    Clear CLM1 Underflow Reset Flag
  * @rmtoll   RSTFR    CLM1_UDF_FLAG    FL_RMU_ClearFlag_CLM1_UDF
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_ClearFlag_CLM1_UDF(RMU_Type* RMUx)
{
    WRITE_REG(RMUx->RSTFR, RMU_RSTFR_CLM1_UDF_FLAG_Msk);
}

/**
  * @brief    Get CLM1 Overflow Reset Flag
  * @rmtoll   RSTFR    CLM1_OVF_FLAG    FL_RMU_IsActiveFlag_CLM1_OVF
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_IsActiveFlag_CLM1_OVF(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->RSTFR, RMU_RSTFR_CLM1_OVF_FLAG_Msk) == (RMU_RSTFR_CLM1_OVF_FLAG_Msk));
}

/**
  * @brief    Get CLM1 Overflow Reset Flag
  * @rmtoll   RSTFR    CLM1_OVF_FLAG    FL_RMU_ClearFlag_CLM1_OVF
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_ClearFlag_CLM1_OVF(RMU_Type* RMUx)
{
    WRITE_REG(RMUx->RSTFR, RMU_RSTFR_CLM1_OVF_FLAG_Msk);
}

/**
  * @brief    Get CLM0 Time Out Reset Flag
  * @rmtoll   RSTFR    CLM0_TOUT_FLAG    FL_RMU_IsActiveFlag_CLM0_TOUT
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_IsActiveFlag_CLM0_TOUT(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->RSTFR, RMU_RSTFR_CLM0_TOUT_FLAG_Msk) == (RMU_RSTFR_CLM0_TOUT_FLAG_Msk));
}

/**
  * @brief    Clear CLM0 Time Out Reset Flag
  * @rmtoll   RSTFR    CLM0_TOUT_FLAG    FL_RMU_ClearFlag_CLM0_TOUT
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_ClearFlag_CLM0_TOUT(RMU_Type* RMUx)
{
    WRITE_REG(RMUx->RSTFR, RMU_RSTFR_CLM0_TOUT_FLAG_Msk);
}

/**
  * @brief    Get CLM0 Underflow Reset Flag
  * @rmtoll   RSTFR    CLM0_UDF_FLAG    FL_RMU_IsActiveFlag_CLM0_UDF
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_IsActiveFlag_CLM0_UDF(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->RSTFR, RMU_RSTFR_CLM0_UDF_FLAG_Msk) == (RMU_RSTFR_CLM0_UDF_FLAG_Msk));
}

/**
  * @brief    Clear CLM0 Underflow Reset Flag
  * @rmtoll   RSTFR    CLM0_UDF_FLAG    FL_RMU_ClearFlag_CLM0_UDF
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_ClearFlag_CLM0_UDF(RMU_Type* RMUx)
{
    WRITE_REG(RMUx->RSTFR, RMU_RSTFR_CLM0_UDF_FLAG_Msk);
}

/**
  * @brief    Get CLM0 Overflow Reset Flag
  * @rmtoll   RSTFR    CLM0_OVF_FLAG    FL_RMU_IsActiveFlag_CLM0_OVF
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_IsActiveFlag_CLM0_OVF(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->RSTFR, RMU_RSTFR_CLM0_OVF_FLAG_Msk) == (RMU_RSTFR_CLM0_OVF_FLAG_Msk));
}

/**
  * @brief    Get CLM0 Overflow Reset Flag
  * @rmtoll   RSTFR    CLM0_OVF_FLAG    FL_RMU_ClearFlag_CLM0_OVF
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_ClearFlag_CLM0_OVF(RMU_Type* RMUx)
{
    WRITE_REG(RMUx->RSTFR, RMU_RSTFR_CLM0_OVF_FLAG_Msk);
}

/**
  * @brief    Get MAP Error Flag
  * @rmtoll   RSTFR    MAP_FLAG    FL_RMU_IsActiveFlag_MAP
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_IsActiveFlag_MAP(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->RSTFR, RMU_RSTFR_MAP_FLAG_Msk) == (RMU_RSTFR_MAP_FLAG_Msk));
}

/**
  * @brief    Clear MAP Reset Flag
  * @rmtoll   RSTFR    MAP_FLAG    FL_RMU_ClearFlag_MAP
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_ClearFlag_MAP(RMU_Type* RMUx)
{
    WRITE_REG(RMUx->RSTFR, RMU_RSTFR_MAP_FLAG_Msk);
}

/**
  * @brief    Get MDF Reset Flag
  * @rmtoll   RSTFR    MDFN_FLAG    FL_RMU_IsActiveFlag_MDF
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_IsActiveFlag_MDF(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->RSTFR, RMU_RSTFR_MDFN_FLAG_Msk) == (RMU_RSTFR_MDFN_FLAG_Msk));
}

/**
  * @brief    Clear MDF Reset Flag
  * @rmtoll   RSTFR    MDFN_FLAG    FL_RMU_ClearFlag_MDF
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_ClearFlag_MDF(RMU_Type* RMUx)
{
    WRITE_REG(RMUx->RSTFR, RMU_RSTFR_MDFN_FLAG_Msk);
}

/**
  * @brief    Get NRST Reset Flag
  * @rmtoll   RSTFR    NRSTN_FLAG    FL_RMU_IsActiveFlag_NRSTN
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_IsActiveFlag_NRSTN(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->RSTFR, RMU_RSTFR_NRSTN_FLAG_Msk) == (RMU_RSTFR_NRSTN_FLAG_Msk));
}

/**
  * @brief    Clear NRST Reset Flag
  * @rmtoll   RSTFR    NRSTN_FLAG    FL_RMU_ClearFlag_NRSTN
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_ClearFlag_NRSTN(RMU_Type* RMUx)
{
    WRITE_REG(RMUx->RSTFR, RMU_RSTFR_NRSTN_FLAG_Msk);
}

/**
  * @brief    Get PRC Reset Flag
  * @rmtoll   RSTFR    PRC_FLAG    FL_RMU_IsActiveFlag_PRCN
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_IsActiveFlag_PRCN(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->RSTFR, RMU_RSTFR_PRC_FLAG_Msk) == (RMU_RSTFR_PRC_FLAG_Msk));
}

/**
  * @brief    Clear PRC Reset Flag
  * @rmtoll   RSTFR    PRC_FLAG    FL_RMU_ClearFlag_PRCN
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_ClearFlag_PRCN(RMU_Type* RMUx)
{
    WRITE_REG(RMUx->RSTFR, RMU_RSTFR_PRC_FLAG_Msk);
}

/**
  * @brief    Get Power On Reset Flag
  * @rmtoll   RSTFR    PORN_FLAG    FL_RMU_IsActiveFlag_PORN
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_IsActiveFlag_PORN(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->RSTFR, RMU_RSTFR_PORN_FLAG_Msk) == (RMU_RSTFR_PORN_FLAG_Msk));
}

/**
  * @brief    Clear Power On Reset Flag
  * @rmtoll   RSTFR    PORN_FLAG    FL_RMU_ClearFlag_PORN
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_ClearFlag_PORN(RMU_Type* RMUx)
{
    WRITE_REG(RMUx->RSTFR, RMU_RSTFR_PORN_FLAG_Msk);
}

/**
  * @brief    Get Power Down Reset Flag
  * @rmtoll   RSTFR    PDRN_FLAG    FL_RMU_IsActiveFlag_PDRN
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_IsActiveFlag_PDRN(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->RSTFR, RMU_RSTFR_PDRN_FLAG_Msk) == (RMU_RSTFR_PDRN_FLAG_Msk));
}

/**
  * @brief    Clear Power Down Reset Flag
  * @rmtoll   RSTFR    PDRN_FLAG    FL_RMU_ClearFlag_PDRN
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_ClearFlag_PDRN(RMU_Type* RMUx)
{
    WRITE_REG(RMUx->RSTFR, RMU_RSTFR_PDRN_FLAG_Msk);
}

/**
  * @brief    Get PLL Lost Lock Reset Flag
  * @rmtoll   RSTFR    LOL_FLAG    FL_RMU_IsActiveFlag_LOL
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_IsActiveFlag_LOL(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->RSTFR, RMU_RSTFR_LOL_FLAG_Msk) == (RMU_RSTFR_LOL_FLAG_Msk));
}

/**
  * @brief    Clear PLL Lost Lock Reset Flag
  * @rmtoll   RSTFR    LOL_FLAG    FL_RMU_ClearFlag_LOL
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_ClearFlag_LOL(RMU_Type* RMUx)
{
    WRITE_REG(RMUx->RSTFR, RMU_RSTFR_LOL_FLAG_Msk);
}

/**
  * @brief    Get Crystal Stop Reset Flag
  * @rmtoll   RSTFR    LOC_FLAG    FL_RMU_IsActiveFlag_LOC
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_IsActiveFlag_LOC(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->RSTFR, RMU_RSTFR_LOC_FLAG_Msk) == (RMU_RSTFR_LOC_FLAG_Msk));
}

/**
  * @brief    Clear Crystal Stop Reset Flag
  * @rmtoll   RSTFR    LOC_FLAG    FL_RMU_ClearFlag_LOC
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_ClearFlag_LOC(RMU_Type* RMUx)
{
    WRITE_REG(RMUx->RSTFR, RMU_RSTFR_LOC_FLAG_Msk);
}

/**
  * @brief    Get Software Reset Flag
  * @rmtoll   RSTFR    SOFTN_FLAG    FL_RMU_IsActiveFlag_SOFTN
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_IsActiveFlag_SOFTN(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->RSTFR, RMU_RSTFR_SOFTN_FLAG_Msk) == (RMU_RSTFR_SOFTN_FLAG_Msk));
}

/**
  * @brief    Clear Software Reset Flag
  * @rmtoll   RSTFR    SOFTN_FLAG    FL_RMU_ClearFlag_SOFTN
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_ClearFlag_SOFTN(RMU_Type* RMUx)
{
    WRITE_REG(RMUx->RSTFR, RMU_RSTFR_SOFTN_FLAG_Msk);
}

/**
  * @brief    Get IWDT Reset Flag
  * @rmtoll   RSTFR    IWDTN_FLAG    FL_RMU_IsActiveFlag_IWDTN
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_IsActiveFlag_IWDTN(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->RSTFR, RMU_RSTFR_IWDTN_FLAG_Msk) == (RMU_RSTFR_IWDTN_FLAG_Msk));
}

/**
  * @brief    Clear IWDT Reset Flag
  * @rmtoll   RSTFR    IWDTN_FLAG    FL_RMU_ClearFlag_IWDTN
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_ClearFlag_IWDTN(RMU_Type* RMUx)
{
    WRITE_REG(RMUx->RSTFR, RMU_RSTFR_IWDTN_FLAG_Msk);
}

/**
  * @brief    Get WWDT Reset Flag
  * @rmtoll   RSTFR    WWDTN_FLAG    FL_RMU_IsActiveFlag_WWDTN
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_IsActiveFlag_WWDTN(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->RSTFR, RMU_RSTFR_WWDTN_FLAG_Msk) == (RMU_RSTFR_WWDTN_FLAG_Msk));
}

/**
  * @brief    Clear WWDT Reset Flag
  * @rmtoll   RSTFR    WWDTN_FLAG    FL_RMU_ClearFlag_WWDTN
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_ClearFlag_WWDTN(RMU_Type* RMUx)
{
    WRITE_REG(RMUx->RSTFR, RMU_RSTFR_WWDTN_FLAG_Msk);
}

/**
  * @brief    Get LockUp Reset Flag
  * @rmtoll   RSTFR    LKUPN_FLAG    FL_RMU_IsActiveFlag_LKUPN
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_IsActiveFlag_LKUPN(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->RSTFR, RMU_RSTFR_LKUPN_FLAG_Msk) == (RMU_RSTFR_LKUPN_FLAG_Msk));
}

/**
  * @brief    Clear LockUp Reset Flag
  * @rmtoll   RSTFR    LKUPN_FLAG    FL_RMU_ClearFlag_LKUPN
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_ClearFlag_LKUPN(RMU_Type* RMUx)
{
    WRITE_REG(RMUx->RSTFR, RMU_RSTFR_LKUPN_FLAG_Msk);
}

/**
  * @brief    Get NVIC Reset Flag
  * @rmtoll   RSTFR    NVICN_FLAG    FL_RMU_IsActiveFlag_NVICN
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_IsActiveFlag_NVICN(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->RSTFR, RMU_RSTFR_NVICN_FLAG_Msk) == (RMU_RSTFR_NVICN_FLAG_Msk));
}

/**
  * @brief    Clear NVIC Reset Flag
  * @rmtoll   RSTFR    NVICN_FLAG    FL_RMU_ClearFlag_NVICN
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_ClearFlag_NVICN(RMU_Type* RMUx)
{
    WRITE_REG(RMUx->RSTFR, RMU_RSTFR_NVICN_FLAG_Msk);
}

/**
  * @brief    Disable Peripheral Reset
  * @rmtoll   PRSTEN        FL_RMU_DisablePeripheralReset
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_DisablePeripheralReset(RMU_Type* RMUx)
{
    WRITE_REG(RMUx->PRSTEN, (~PERHRSTEN_KEY));
}

/**
  * @brief    Enable Peripheral Reset
  * @rmtoll   PRSTEN        FL_RMU_EnablePeripheralReset
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_EnablePeripheralReset(RMU_Type* RMUx)
{
    WRITE_REG(RMUx->PRSTEN, PERHRSTEN_KEY);
}

/**
  * @brief    Enable AHB Peripheral Reset
  * @rmtoll   AHBRSTCR        FL_RMU_EnableResetAHBPeripheral
  * @param    RMUx RMU instance
  * @param    peripheral This parameter can be one of the following values:
  *           @arg @ref FL_RMU_RSTAHB_DMA
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_EnableResetAHBPeripheral(RMU_Type* RMUx, uint32_t peripheral)
{
    SET_BIT(RMUx->AHBRSTCR, ((peripheral & 0xffffffff) << 0x0U));
}

